
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрНакопления Приход
	Движения.РегистрНакопления.Записывать = Истина;
	Для Каждого ТекСтрокаСписокНоменклатура Из СписокНоменклатура Цикл
		Движение = Движения.РегистрНакопления.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокНоменклатура.Номенклатура;
		Движение.СрокГодности = ТекСтрокаСписокНоменклатура.СрокГодности;
		Движение.Количество = ТекСтрокаСписокНоменклатура.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
