
Процедура ОбработкаПроведения(Отказ, Режим) 
	Движения.РегистрНакопления.Записывать = Истина;
	Движения.РегистрНакопления.Записать();
	
   	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовараСписокНоменклатура.Номенклатура КАК Номенклатура,
		|	ПродажаТовараСписокНоменклатура.Количество КАК Количество,
		|	ПродажаТовараСписокНоменклатура.СрокГодности КАК СрокГодности
		|ПОМЕСТИТЬ ВременнаяТаблицаПродажи
		|ИЗ
		|	Документ.ПродажаТовара.СписокНоменклатура КАК ПродажаТовараСписокНоменклатура
		|ГДЕ
		|	ПродажаТовараСписокНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПродажи.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаПродажи.Количество КАК Количество,
		|	ВременнаяТаблицаПродажи.СрокГодности КАК СрокГодности,
		|	РегистрНакопленияОстатки.СрокГодности КАК СрокГодности1,
		|	РегистрНакопленияОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВременнаяТаблицаПродажи.СрокГодности = РегистрНакопленияОстатки.СрокГодности КАК Приоритет
		|ИЗ
		|	ВременнаяТаблицаПродажи КАК ВременнаяТаблицаПродажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления.Остатки(&Дата, ) КАК РегистрНакопленияОстатки
		|		ПО ВременнаяТаблицаПродажи.Номенклатура = РегистрНакопленияОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ,
		|	ВременнаяТаблицаПродажи.СрокГодности
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если  ВыборкаНоменклатура.Количество >  ВыборкаНоменклатура.КоличествоОстаток Тогда
			Сообщить("Недостаточно товара " + ВыборкаНоменклатура.Номенклатура + " в кол-ве " +
		(ВыборкаНоменклатура.КоличествоОстаток - ВыборкаНоменклатура.Количество));
			Отказ = Истина;
		КонецЕсли;  
		
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
	    ОсталосьСписать = ВыборкаНоменклатура.Количество;
        
		Пока ВыборкаДетальныеЗаписи.Следующий() И ОсталосьСписать > 0 Цикл
			КоличествоСписывания = Мин(ОсталосьСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Движение = Движения.РегистрНакопления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.СрокГодности = ВыборкаДетальныеЗаписи.СрокГодности1;
			Движение.Количество = КоличествоСписывания;
			ОсталосьСписать = ОсталосьСписать - КоличествоСписывания;	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
