
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрНакопленияОстатки.СрокГодности КАК СрокГодности,
		|	РегистрНакопленияОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	РегистрНакопленияОстатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.РегистрНакопления.Остатки(&Дата, Номенклатура = &Номенклатура) КАК РегистрНакопленияОстатки";
	
	Запрос.УстановитьПараметр("Дата", Параметры.Дата);
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСрокиГодности.Очистить();
	Для каждого Стр Из РезультатЗапроса Цикл
	   НоваяСтрока = ТаблицаСрокиГодности.Добавить();
	   НоваяСтрока.СрокГодности = Стр.СрокГодности;
	   НоваяСтрока.Остаток = Стр.КоличествоОстаток;
 	КонецЦикла;
КонецПроцедуры



&НаКлиенте
Процедура Выбрать(Команда)

    ТекСтрока = Элементы.ТаблицаСрокиГодности.ТекущиеДанные;

    Если ТекСтрока = Неопределено Тогда
        Предупреждение("Выберите срок годности");
        Возврат;
	КонецЕсли;

	Результат = Новый Структура;
    Результат.Вставить("СрокГодности", ТекСтрока.СрокГодности);
    
  	Закрыть(Результат);

КонецПроцедуры
