
&НаКлиенте
Процедура СписокНоменклатураНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокНоменклатура.ТекущиеДанные;
	
	 Если ТекСтрока.Номенклатура = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Цена = ПолучитьЦену(Объект.Дата, ТекСтрока.Номенклатура);
	
	Если Цена <> Неопределено Тогда
		ТекСтрока.Сумма = ТекСтрока.Количество * Цена;
    КонецЕсли;
КонецПроцедуры
  
  
&НаСервере
Функция ПолучитьЦену(Дата, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСведенийСрезПоследних.Номенклатура КАК Номенклатура,
		|	РегистрСведенийСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.РегистрСведений.СрезПоследних(&Дата, Номенклатура В (&Номенклатура)) КАК РегистрСведенийСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Цена;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	


&НаКлиенте
Процедура СписокНоменклатураКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокНоменклатура.ТекущиеДанные;
	Цена = ПолучитьЦену(Объект.Дата, ТекСтрока.Номенклатура);
	Если Цена <> Неопределено Тогда
		ТекСтрока.Сумма = ТекСтрока.Количество * Цена;
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВыборСрокаГодности(ВыбранныйСрок, ДопПараметры) Экспорт
	Если ВыбранныйСрок = Неопределено Тогда
        Возврат;
	КонецЕсли;
	 ТекСтрока = Элементы.СписокНоменклатура.ТекущиеДанные;
	 ТекСтрока.СрокГодности = ВыбранныйСрок.СрокГодности;
	
 КонецПроцедуры


&НаКлиенте
 Процедура СписокНоменклатураСрокГодностиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь; 
	 ТекСтрока = Элементы.СписокНоменклатура.ТекущиеДанные;
	 
	 Если ТекСтрока = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", ТекСтрока.Номенклатура);
	Оповещение = Новый ОписаниеОповещения("ВыборСрокаГодности", ЭтотОбъект);
	ОткрытьФорму("Документ.ПродажаТовара.Форма.ФормаСрокГодности", ПараметрыФормы,,,,,Оповещение);
	
 КонецПроцедуры

